# Pandas DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

## Part1 : Basics

In [3]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #Data, Index, Column_name

In [7]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Selecting column

** Each column in df is a Series **

In [12]:
df['W']

A   -2.141212
B    1.292765
C    0.485809
D    1.541990
E    1.407338
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [15]:
df[['X','W']]

          X         W
A  0.992573 -2.141212
B -1.467514  1.292765
C  0.392489  0.485809
D  0.666319  1.541990
E  0.641806  1.407338

** Adding new column **

In [17]:
df['U'] = df['X'] + df['Y']  # Adds new column 'U'

In [18]:
df

          W         X         Y         Z         U
A -2.141212  0.992573  1.192241 -1.046780  2.184814
B  1.292765 -1.467514 -0.494095 -0.162535 -1.961609
C  0.485809  0.392489  0.221491 -0.855196  0.613979
D  1.541990  0.666319 -0.538235 -0.568581  0.128085
E  1.407338  0.641806 -0.905100 -0.391157 -0.263294

** Dropping column **

In [20]:
df.drop('U',axis=1)

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [21]:
df

          W         X         Y         Z         U
A -2.141212  0.992573  1.192241 -1.046780  2.184814
B  1.292765 -1.467514 -0.494095 -0.162535 -1.961609
C  0.485809  0.392489  0.221491 -0.855196  0.613979
D  1.541990  0.666319 -0.538235 -0.568581  0.128085
E  1.407338  0.641806 -0.905100 -0.391157 -0.263294

** What!!, the column is still there. Got an idea **

In [23]:
df.drop('U',axis=1, inplace=True)

In [24]:
df

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

** Gone! **

#### Dropping row

In [34]:
df.drop('A',axis=0)

          W         X         Y         Z
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

### Selecting Rows

In [25]:
df.loc['A']  # Method 1 - Index based selection

W   -2.141212
X    0.992573
Y    1.192241
Z   -1.046780
Name: A, dtype: float64

In [26]:
df.iloc[2]  # Mthod 2 - Numerical based selection

W    0.485809
X    0.392489
Y    0.221491
Z   -0.855196
Name: C, dtype: float64

In [35]:
df.loc[['A','B']]   # Multiple rows and all columns

          W         X         Y         Z
A -2.141212  0.992573  1.192241 -1.046780
B  1.292765 -1.467514 -0.494095 -0.162535

In [31]:
df.loc['A','W']   # Paticular location value

-2.1412122910809264

#### Getting subset

In [33]:
df.loc[['A','B'],['W','X']]

          W         X
A -2.141212  0.992573
B  1.292765 -1.467514

## Part 2

#### Conditional selection

In [37]:
booldf = df > 0

In [38]:
df[booldf]

          W         X         Y   Z
A       NaN  0.992573  1.192241 NaN
B  1.292765       NaN       NaN NaN
C  0.485809  0.392489  0.221491 NaN
D  1.541990  0.666319       NaN NaN
E  1.407338  0.641806       NaN NaN

In [53]:
df['W'] > 0

A    False
B     True
C     True
D     True
E     True
Name: W, dtype: bool

In [54]:
df['Z'][df['W'] > 0]

B   -0.162535
C   -0.855196
D   -0.568581
E   -0.391157
Name: Z, dtype: float64

In [43]:
df[df['W'] > 0]

          W         X         Y         Z
B  1.292765 -1.467514 -0.494095 -0.162535
C  0.485809  0.392489  0.221491 -0.855196
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157

In [48]:
df[df['Y'] < 0]

          W         X         Y         Z
B  1.292765 -1.467514 -0.494095 -0.162535
D  1.541990  0.666319 -0.538235 -0.568581
E  1.407338  0.641806 -0.905100 -0.391157


## Part 3 - Multi index and Hierarchy

In [7]:
 # INDEX LEVELS
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
print hier_index
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [8]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [9]:
df

             A         B
G1 1  1.062004  2.614899
   2 -2.071819 -0.695822
   3  0.304794  0.614648
G2 1  0.434062 -1.386868
   2  1.293620 -0.854221
   3 -0.216517  0.017182

In [13]:
df.loc['G1'].loc[2]

A   -2.071819
B   -0.695822
Name: 2, dtype: float64

In [15]:
df.index.names = ['Groups','Num']

In [16]:
df

                   A         B
Groups Num
G1     1    1.062004  2.614899
       2   -2.071819 -0.695822
       3    0.304794  0.614648
G2     1    0.434062 -1.386868
       2    1.293620 -0.854221
       3   -0.216517  0.017182

In [17]:
df.loc['G2'].loc[2]['A']

1.2936197303438182

** Cross section functionusage **

In [18]:
df.xs('G1')

            A         B
Num
1    1.062004  2.614899
2   -2.071819 -0.695822
3    0.304794  0.614648

In [19]:
df.xs(1, level='Num')

               A         B
Groups
G1      1.062004  2.614899
G2      0.434062 -1.386868